CSI API ETABS v1
cCaseResponseSpectrum.SetLoads Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoads(
	string Name,
	int NumberLoads,
	ref string[] LoadName,
	ref string[] Func,
	ref double[] SF,
	ref string[] CSys,
	ref double[] Ang
)
Function SetLoads (
	Name As String,
	NumberLoads As Integer,
	ByRef LoadName As String(),
	ByRef Func As String(),
	ByRef SF As Double(),
	ByRef CSys As String(),
	ByRef Ang As Double()
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim NumberLoads As Integer
Dim LoadName As String()
Dim Func As String()
Dim SF As Double()
Dim CSys As String()
Dim Ang As Double()
Dim returnValue As Integer
returnValue = instance.SetLoads(Name,
	NumberLoads, LoadName, Func, SF, CSys,
	Ang)
int SetLoads(
	String^ Name,
	int NumberLoads,
	array<String^>^% LoadName,
	array<String^>^% Func,
	array<double>^% SF,
	array<String^>^% CSys,
	array<double>^% Ang
)
abstract SetLoads :
        Name : string *
        NumberLoads : int *
        LoadName : string[] byref *
        Func : string[] byref *
        SF : float[] byref *
        CSys : string[] byref *
        Ang : float[] byref -> int
Parameters
Name
Type: System.String
NumberLoads
Type: System.Int32
LoadName
Type: System.String[]
Func
Type: System.String[]
SF
Type: System.Double[]
CSys
Type: System.String[]
Ang
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace